#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # module.container.docker_container.nginx[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "docker_container" "nginx" {
      [32m+[0m [0m[1m[0mattach[0m[0m           = false
      [32m+[0m [0m[1m[0mbridge[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mcommand[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mcontainer_logs[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mentrypoint[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0menv[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mexit_code[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mgateway[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mhostname[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mimage[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0minit[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mip_address[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mip_prefix_length[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mipc_mode[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mlog_driver[0m[0m       = "json-file"
      [32m+[0m [0m[1m[0mlogs[0m[0m             = false
      [32m+[0m [0m[1m[0mmust_run[0m[0m         = true
      [32m+[0m [0m[1m[0mname[0m[0m             = "env_stg_container"
      [32m+[0m [0m[1m[0mnetwork_data[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mread_only[0m[0m        = false
      [32m+[0m [0m[1m[0mremove_volumes[0m[0m   = true
      [32m+[0m [0m[1m[0mrestart[0m[0m          = "no"
      [32m+[0m [0m[1m[0mrm[0m[0m               = false
      [32m+[0m [0m[1m[0msecurity_opts[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mshm_size[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mstart[0m[0m            = true
      [32m+[0m [0m[1m[0mstdin_open[0m[0m       = false
      [32m+[0m [0m[1m[0mtty[0m[0m              = false

      [32m+[0m [0mhealthcheck {
          [32m+[0m [0m[1m[0minterval[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mretries[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mstart_period[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtest[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mtimeout[0m[0m      = (known after apply)
        }

      [32m+[0m [0mlabels {
          [32m+[0m [0m[1m[0mlabel[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mvalue[0m[0m = (known after apply)
        }

      [32m+[0m [0mports {
          [32m+[0m [0m[1m[0mexternal[0m[0m = 8081
          [32m+[0m [0m[1m[0minternal[0m[0m = 80
          [32m+[0m [0m[1m[0mip[0m[0m       = "0.0.0.0"
          [32m+[0m [0m[1m[0mprotocol[0m[0m = "tcp"
        }
    }

[1m  # module.image.docker_image.nginx[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "docker_image" "nginx" {
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlatest[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m        = "nginx:1.21.1"
      [32m+[0m [0m[1m[0moutput[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mrepo_digest[0m[0m = (known after apply)
    }

[0m[1mPlan:[0m 2 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>